#include<iostream>
using namespace std;
int main()
{
	setlocale(LC_CTYPE, "ukr");
	int my, bot;
	cout<<"Ви майже пройшли гру, залишилося тiльки перемогти останнього боса.Про останнього боса нiчого невiдома. Слiд мати на увазi, що вiн може мати iмунiтет до деяких видiв атак. Для того щоб почати битву виберiть собi персонажа i персонажа своєму помiчнику (боту).\nВиберiть для себе персонажа :\n1.Лицар(даний персонаж не володiє магiєю, вiн повiльний але надає потужнi удари мечем, а також володiє великим запасом HP)\n2.Маг(даний персонаж володiє потужною  магiєю, вiн повiльний але надає дуже потужнi удари заклинаннями, але володiє малим  запасом HP)\n3.Лучник(даний персонаж володiє середньою магiєю, вiн доволi швидкий  але надає недуже потужнi удари i володiє малим  запасом HP)\n4.Ловкач(даний персонаж володiє середньою магiєю, вiн дуже швидкий  але надає недуже потужнi удари i володiє середнiм  запасом HP)\n";
	cin >> my;
	cout<<"Виберiть для помiчника персонажа :\n1.Лицар(даний персонаж не володiє магiєю, вiн повiльний але надає потужнi удари мечем, а також володiє великим запасом HP)\n2.Маг(даний персонаж володiє потужною  магiєю, вiн повiльний але надає дуже потужнi удари заклинаннями, але володiє малим  запасом HP)\n3.Лучник(даний персонаж володiє середньою магiєю, вiн доволi швидкий  але надає недуже потужнi удари стрiлами та магiєю i володiє малим  запасом HP)\n4.Ловкач(даний персонаж володiє середньою магiєю, вiн дуже швидкий  але надає недуже потужнi удари i володiє середнiм  запасом HP)\n"; 
	cin >> bot;
	if (my == 1 && bot == 2 || my == 2 && bot == 1)
		cout << "Ви програли. У боса виявився 100% iмунiтет до магiї.\n";
	else if (my == 1 && bot == 3 || my == 3 && bot == 1)
		cout << "Ви перемогли:)\n";
	else if (my == 1 && bot == 4 || my == 4 && bot == 1)
		cout << "Ви програли. У боса виявилася мiцна броня, яку ловкач не змiг пробити.\n";
	else if (my == 2 && bot == 3 || my == 3 && bot == 2)
		cout << "Ви програли. У боса виявилися 100% iмунiтет до магiї i мiцна броня, яку лучник не змiг пробити.\n";
	else if (my == 2 && bot == 4 || my == 4 && bot == 2)
		cout << "Ви програли. У боса виявилися 100% iмунiтет до магiї i мiцна броня, яку ловкач не змiг пробити\n.";
	else if (my == 3 && bot == 4 || my == 411 && bot == 3)
		cout << "Ви програли. У боса виявилися 100% iмунiтет до магiї i мiцна броня, яку ловкач i лучник  не змігли пробити.\n";
	else if (my == 1 && bot == 1)
		cout << "Ви перемогли:)";
	else if (my == 2 && bot == 2)
		cout << "Ви програли. У боса виявився 100% iмунiтет до магiї.\n";
	else if (my == 3 && bot == 3)
		cout << "Ви програли. У боса виявилися 100% iмунiтет до магiї i мiцна броня, яку лучники не змiгли пробити.\n";
	else if (my == 4 && bot == 4)
		cout << "Ви програли. У боса виявилися 100% iмунiтет до магiї i мiцна броня, яку ловкачi не змiгли пробити.\n";
	system("pause");
}